In [1]:
import pandas as pd

In [2]:
# merge -----> two data join -----> merging
dict1 = {
    'name':['A','B','C'],
    'age':(34,45,89)
}

In [3]:
dict2 = {
    'name':['X','Y','Z'],
    'hobby':[1,2,3]
}

In [4]:
df = pd.DataFrame(dict1)
df

  name  age
0    A   34
1    B   45
2    C   89

In [5]:
df2 = pd.DataFrame(dict2)
df2

  name  hobby
0    X      1
1    Y      2
2    Z      3

In [6]:
pd.merge(df,df2)

Empty DataFrame
Columns: [name, age, hobby]
Index: []

In [7]:
pd.merge(df,df2, how = 'inner')

Empty DataFrame
Columns: [name, age, hobby]
Index: []

In [8]:
f = pd.merge(df, how = 'inner')

TypeError: merge() missing 1 required positional argument: 'right'

## Merge
### how can we merge our files

In [9]:
pd.merge(df,df2,how = 'outer')

  name   age  hobby
0    A  34.0    NaN
1    B  45.0    NaN
2    C  89.0    NaN
3    X   NaN    1.0
4    Y   NaN    2.0
5    Z   NaN    3.0

In [10]:
pd.merge(df,df2,how = 'left')

  name  age  hobby
0    A   34    NaN
1    B   45    NaN
2    C   89    NaN

In [11]:
pd.merge(df,df2,how = 'right')

  name  age  hobby
0    X  NaN      1
1    Y  NaN      2
2    Z  NaN      3

In [12]:
pd.merge(df,df2,how = 'inner')

Empty DataFrame
Columns: [name, age, hobby]
Index: []